devops/Docker-assignment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-16 Thu 11:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Docker-assignment</title>
<meta name="author" content="D Karthik" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="https://deepalgorithms.in/assets/icons/favicon.png">
<link rel="stylesheet" type="text/css" href="readtheorg-htmlize.css"/>
<link rel="stylesheet" type="text/css" href="readtheorg.css"/>
<link rel="icon" type="image/png" href="https://deepalgorithms.in/images/favicon.png">
<link rel="icon" type="image/png" href="https://deepalgorithms.in/assets/icons/favicon.png">
<link rel="stylesheet" type="text/css" href="readtheorg-htmlize.css"/>
<link rel="stylesheet" type="text/css" href="readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Docker-assignment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb0aa81a">DockerFile Assignment</a>
<ul>
<li><a href="#orga97a41f">Create Node.js DockerFile</a>
<ul>
<li><a href="#org0915edd">Solution</a></li>
</ul>
</li>
<li><a href="#orga3b6313">Create Custome Nginx</a></li>
<li><a href="#org7ffc418">Create Nginx using Debian image</a></li>
<li><a href="#orge7f0c4d">Create apline image which sleep for 10,000 ms</a></li>
<li><a href="#org05ff31c">Image with entry point and cmd</a></li>
<li><a href="#orge43c0bb">Execute the shell script inside dockerfile</a></li>
<li><a href="#orgd0d3730">Run custom jekyll server with bindmount</a></li>
</ul>
</li>
<li><a href="#orgfbb808b">Docker compose</a>
<ul>
<li><a href="#orgb837257">Use Compose to Build with Drupal content with postgres</a></li>
<li><a href="#org153efb4">compose build for nginx</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb0aa81a" class="outline-2">
<h2 id="orgb0aa81a">DockerFile Assignment</h2>
<div class="outline-text-2" id="text-orgb0aa81a">
</div>
<div id="outline-container-orga97a41f" class="outline-3">
<h3 id="orga97a41f">Create Node.js DockerFile</h3>
<div class="outline-text-3" id="text-orga97a41f">
<p>
The dir contains a Node.js app, you need to get it running in a container
</p>

<p>
Overview of this assignment
</p>

<ul class="org-ul">
<li>Instructions from the app developer
<ul class="org-ul">
<li>you should use the 'node' official image, with the alpine 6.x branch
<ul class="org-ul">
<li><code>FROM node:6-alpine</code></li>
</ul></li>
</ul></li>
<li>this app listens on port 3000, but the container should launch on port 80, so that it will respond to <a href="http://localhost">http://localhost</a> on your computer
<ul class="org-ul">
<li><code>EXPOSE 3000</code></li>
</ul></li>

<li>then it should use alpine package manager to install tini: 'apk add &#x2013;update tini'
<ul class="org-ul">
<li><code>RUN apk add --update tini</code></li>
</ul></li>
<li>then it should create directory /usr/src/app for app files with 'mkdir -p /usr/src/app'
<ul class="org-ul">
<li><code>RUN mkdir -p /usr/scr/app</code></li>
</ul></li>
<li>Node uses a "package manager", so it needs to copy in package.json file
<ul class="org-ul">
<li><code>WORKDIR /usr/src/app</code></li>
<li><code>COPY package.json package.json</code></li>
</ul></li>
<li>then it needs to run 'npm install' to install dependencies from that file
<ul class="org-ul">
<li><code>RUN npm install &amp;&amp; npm cache clean</code></li>
</ul></li>
<li>to keep it clean and small, run 'npm cache clean &#x2013;force' after above</li>
<li>then it needs to copy in all files from current directory
<ul class="org-ul">
<li><code>COPY . .</code></li>
</ul></li>
<li>then it needs to start container with command '/sbin/tini &#x2013; node ./bin/www'
<ul class="org-ul">
<li><code>CMD ["tini","--","node","./bin/www"]</code></li>
</ul></li>

<li>in the end you should be using FROM, RUN, WORKDIR, COPY, EXPOSE, and CMD commands</li>
</ul>
</div>

<div id="outline-container-org0915edd" class="outline-4">
<h4 id="org0915edd">Solution</h4>
<div class="outline-text-4" id="text-org0915edd">
<div class="org-src-container">
<pre class="src src-sh">#file name : Dockerfile
FROM node:6-alpine
EXPOSE 3000
RUN apk add --update tini
WORKDIR /usr/src/app
COPY package.json package.json
RUN npm install &amp;&amp; npm cache clean --force
COPY . .
CMD [ "/sbin/tini", "--", "node", "./bin/www" ]
</pre>
</div>

<p>
Build the Dockerfile
</p>

<div class="org-src-container">
<pre class="src src-sh">docker build -t testnode .   # build the testnode
docker run -rm testnode -p 80:3000 
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-orga3b6313" class="outline-3">
<h3 id="orga3b6313">Create Custome Nginx</h3>
<div class="outline-text-3" id="text-orga3b6313">
<div class="org-src-container">
<pre class="src src-sh"># this shows how we can extend/change an existing official image from Docker Hub

FROM nginx:latest
# highly recommend you always pin versions for anything beyond dev/learn

WORKDIR /usr/share/nginx/html
# change working directory to root of nginx webhost
# using WORKDIR is preferred to using 'RUN cd /some/path'

COPY index.html index.html

# I don't have to specify EXPOSE or CMD because they're in my FROM
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ffc418" class="outline-3">
<h3 id="org7ffc418">Create Nginx using Debian image</h3>
<div class="outline-text-3" id="text-org7ffc418">
<div class="org-src-container">
<pre class="src src-sh"># NOTE: this example is taken from the default Dockerfile for the official nginx Docker Hub Repo
# https://hub.docker.com/_/nginx/
# NOTE: This file is slightly different than the video, because nginx versions have been updated 
#       to match the latest standards from docker hub... but it's doing the same thing as the video
#       describes
FROM debian:stretch-slim
# all images must have a FROM
# usually from a minimal Linux distribution like debian or (even better) alpine
# if you truly want to start with an empty container, use FROM scratch

ENV NGINX_VERSION 1.13.6-1~stretch
ENV NJS_VERSION   1.13.6.0.1.14-1~stretch
# optional environment variable that's used in later lines and set as envvar when container is running

RUN apt-get update \
	&amp;&amp; apt-get install --no-install-recommends --no-install-suggests -y gnupg1 \
	&amp;&amp; \
	NGINX_GPGKEY=573BFD6B3D8FBC641079A6ABABF5BD827BD9BF62; \
	found=''; \
	for server in \
		ha.pool.sks-keyservers.net \
		hkp://keyserver.ubuntu.com:80 \
		hkp://p80.pool.sks-keyservers.net:80 \
		pgp.mit.edu \
	; do \
		echo "Fetching GPG key $NGINX_GPGKEY from $server"; \
		apt-key adv --keyserver "$server" --keyserver-options timeout=10 --recv-keys "$NGINX_GPGKEY" &amp;&amp; found=yes &amp;&amp; break; \
	done; \
	test -z "$found" &amp;&amp; echo &gt;&amp;2 "error: failed to fetch GPG key $NGINX_GPGKEY" &amp;&amp; exit 1; \
	apt-get remove --purge -y gnupg1 &amp;&amp; apt-get -y --purge autoremove &amp;&amp; rm -rf /var/lib/apt/lists/* \
	&amp;&amp; echo "deb http://nginx.org/packages/mainline/debian/ stretch nginx" &gt;&gt; /etc/apt/sources.list \
	&amp;&amp; apt-get update \
	&amp;&amp; apt-get install --no-install-recommends --no-install-suggests -y \
						nginx=${NGINX_VERSION} \
						nginx-module-xslt=${NGINX_VERSION} \
						nginx-module-geoip=${NGINX_VERSION} \
						nginx-module-image-filter=${NGINX_VERSION} \
						nginx-module-njs=${NJS_VERSION} \
						gettext-base \
	&amp;&amp; rm -rf /var/lib/apt/lists/*
# optional commands to run at shell inside container at build time
# this one adds package repo for nginx from nginx.org and installs it

RUN ln -sf /dev/stdout /var/log/nginx/access.log \
	&amp;&amp; ln -sf /dev/stderr /var/log/nginx/error.log
# forward request and error logs to docker log collector

EXPOSE 80 443
# expose these ports on the docker virtual network
# you still need to use -p or -P to open/forward these ports on host

CMD ["nginx", "-g", "daemon off;"]
# required: run this command when container is launched
# only one CMD allowed, so if there are multiple, last one wins
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7f0c4d" class="outline-3">
<h3 id="orge7f0c4d">Create apline image which sleep for 10,000 ms</h3>
<div class="outline-text-3" id="text-orge7f0c4d">
<pre class="example">
FROM alpine

# method one, shell form
CMD sleep 10000

# method two, exec form
#CMD ["sleep", "10000"]
</pre>
</div>
</div>
<div id="outline-container-org05ff31c" class="outline-3">
<h3 id="org05ff31c">Image with entry point and cmd</h3>
<div class="outline-text-3" id="text-org05ff31c">
<pre class="example">
FROM alpine

# the executable
ENTRYPOINT ["sleep"]

# the default arguments
CMD ["10000"]
</pre>
</div>
</div>


<div id="outline-container-orge43c0bb" class="outline-3">
<h3 id="orge43c0bb">Execute the shell script inside dockerfile</h3>
<div class="outline-text-3" id="text-orge43c0bb">
<div class="org-src-container">
<pre class="src src-sh">FROM alpine

COPY ./docker-entrypoint.sh /

ENTRYPOINT ["/docker-entrypoint.sh"]

CMD ["ping", "8.8.8.8"]
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sh">#file : docker-entrypoint.sh
#!/bin/sh
set -e

cat /etc/hosts
echo "ok i'm done, now let's ping'"

exec "$@"

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd0d3730" class="outline-3">
<h3 id="orgd0d3730">Run custom jekyll server with bindmount</h3>
<div class="outline-text-3" id="text-orgd0d3730">
<p>
The dir fo jelly is <code>/media/jayradhey/myVolume/workspace/workspace_devops/udemy-docker-mastery-master/bindmount-sample-1</code>
</p>

<div class="org-src-container">
<pre class="src src-sh"># pwd # /media/jayradhey/myVolume/workspace/workspace_devops/udemy-docker-mastery-master/bindmount-sample-1

docker run -p 80:4000 -v $(pwd):/site bretfisher/jekyll-serve

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfbb808b" class="outline-2">
<h2 id="orgfbb808b">Docker compose</h2>
<div class="outline-text-2" id="text-orgfbb808b">
</div>
<div id="outline-container-orgb837257" class="outline-3">
<h3 id="orgb837257">Use Compose to Build with Drupal content with postgres</h3>
<div class="outline-text-3" id="text-orgb837257">
<p>
&gt; Goal: Create a compose config for a local Drupal CMS website
</p>

<ul class="org-ul">
<li>This empty directory is where you should create a docker-compose.yml</li>
<li>Use the `drupal:8.8.2` image along with the `postgres:12.1` image</li>
<li>Set the version to 2</li>
<li>Use `ports` to expose Drupal on 8080</li>
<li>Be sure to setup POSTGRES<sub>PASSWORD</sub> on postgres image</li>
<li>Walk though Drupal config in browser at <a href="http://localhost:8080">http://localhost:8080</a></li>
<li>Tip: Drupal assumes DB is localhost, but it will actually be on the compose service name you give it</li>
<li>Use Docker Hub documentation to figure out the right environment and volume settings</li>
<li>Extra Credit: Use volumes to store Drupal unique data</li>
</ul>

<p>
<a href="https://hub.docker.com/_/drupal/">https://hub.docker.com/_/drupal/</a>
</p>
<div class="org-src-container">
<pre class="src src-sh">version: '2'

services:
  drupal:
    image: drupal:8.8.2
    ports:
      - "8080:80"
    volumes:
      - drupal-modules:/var/www/html/modules
      - drupal-profiles:/var/www/html/profiles       
      - drupal-sites:/var/www/html/sites      
      - drupal-themes:/var/www/html/themes
  postgres:
    image: postgres:12.1
    environment:
      - POSTGRES_PASSWORD=mypasswd

volumes:
  drupal-modules:
  drupal-profiles:
  drupal-sites:
  drupal-themes:
</pre>
</div>
</div>
</div>


<div id="outline-container-org153efb4" class="outline-3">
<h3 id="org153efb4">compose build for nginx</h3>
<div class="outline-text-3" id="text-org153efb4">
<p>
File structure
</p>
<div class="org-src-container">
<pre class="src src-sh">#pwd
 # &gt;&gt; # /media/jayradhey/myVolume/workspace/workspace_devops/udemy-docker-mastery-master/compose-sample-3
├── docker-compose.yml
├── html
├── nginx.conf
└── nginx.Dockerfile
</pre>
</div>


<div class="org-src-container">
<pre class="src src-yaml"># file : docker-compose.yml 
version: '2'

# based off compose-sample-2, only we build nginx.conf into image
# uses sample site from https://startbootstrap.com/template-overviews/agency/

services:
  proxy:
    build:
      context: .
      dockerfile: nginx.Dockerfile
    ports:
      - '80:80'
  web:
    image: httpd
    volumes:
      - ./html:/usr/local/apache2/htdocs/
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sh">#file : nginx.Dockerfile 
FROM nginx:1.13
COPY nginx.conf /etc/nginx/conf.d/default.conf
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sh">#file : nginx.conf
server {

	listen 80;

	location / {

		proxy_pass         http://web;
		proxy_redirect     off;
		proxy_set_header   Host $host;
		proxy_set_header   X-Real-IP $remote_addr;
		proxy_set_header   X-Forwarded-For $proxy_add_x_forwarded_for;
		proxy_set_header   X-Forwarded-Host $server_name;

	}
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: D Karthik</p>
<p class="date">Created: 2023-03-16 Thu 11:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
